contact me in telegram [alex seikin](https://t.me/seikin_alexey)

## Задание
У вас SQL база с таблицами магазина, который существует много лет:
1) Users(userId, age)
2) Purchases (purchaseId, userId, itemId, date)
3) Items (itemId, price).

Напишите SQL запросы для расчета следующих метрик:

А) какую сумму в среднем в месяц тратит:
  - пользователи в возрастном диапазоне от 18 до 25 лет включительно
  - пользователи в возрастном диапазоне от 26 до 35 лет включительно

Б) в каком месяце года выручка от пользователей в возрастном диапазоне 35+ самая большая

В) какой товар обеспечивает дает наибольший вклад в выручку за последний год

Г) топ-3 товаров по выручке и их доля в общей выручке за любой год

Будет здорово, если ваше решение оформлено в виде работающего кода и основательно протестировано на придуманных данных (код наполнения бд НЕ прикладывайте). 
Для тестирования можно использовать онлайн-редактор https://sqliteonline.com/
Предпочтительный диалект - PostgreSQL, но можете использовать любой из доступных.

## План работы

1. создать бд и подключится к ней
2. импортировать таблицы с игрушечными данными в бд
3. выполнить SQL запросы из задания

## Импорты

In [1]:
import pandas as pd
from sqlalchemy import create_engine
import csv
from io import StringIO

## Вспомогательные функции

In [2]:
# создание подключения к базе данных PostgresSQL
db_host = 'surus.db.elephantsql.com'
db_name = 'xftllppj'
db_user_name = 'xftllppj'
db_pass = 'nSZxkk4NKFagwgxRE8YsRjKO0j3EWUbW'

connecton_ps = create_engine(f'postgresql+psycopg2://{db_user_name}:{db_pass}@{db_host}/{db_name}')
#connecton_ps = create_engine('postgresql+psycopg2://xftllppj:nSZxkk4NKFagwgxRE8YsRjKO0j3EWUbW@surus.db.elephantsql.com/xftllppj')

In [3]:
# запрос к бд
def select(sql):
  return pd.read_sql(sql, connecton_ps)

 ## Импорт датасетов в переменные

In [4]:
# Импорт датасета с пользователями
users = pd.read_csv('datasets/who_is_blogger_dataset_users.csv')
users.head(5)

   userId  age
0     210   33
1     929   43
2     200   52
3      45   35
4     358   28

In [5]:
# Импорт датасета с товарами
items = pd.read_csv('datasets/who_is_blogger_dataset_items.csv')
items.head(5)

   itemId   price
0      95  161.38
1      12   35.34
2     195  146.50
3      89  119.21
4     136  105.24

In [6]:
# Импорт датасета с покупками с преобразованием даты к типу datetime64[ns]
purchases = pd.read_csv('datasets/who_is_blogger_dataset_purchases.csv')
purchases['date'] = pd.to_datetime(purchases['date'], format='%Y-%m-%d %H:%M:%S')
display(purchases.dtypes)
display(purchases.head(5))

purchaseId             int64
itemId                 int64
userId                 int64
date          datetime64[ns]
amount               float64
dtype: object

   purchaseId  itemId  userId                date  amount
0        4850     184     950 2008-04-06 11:54:47  161.38
1        2356      24     418 2007-07-28 00:00:19   35.34
2        2922     164     131 2008-03-14 20:43:54  146.50
3        4929     198     353 2007-12-18 13:03:24  119.21
4         510       5     849 2007-11-09 05:18:30  105.24

## Заливка датасетов в базу данных

In [7]:
users.to_sql('Users', connecton_ps, index=False, if_exists='replace')#, method=psql_insert_copy)
items.to_sql('Items', connecton_ps, index=False, if_exists='replace')#, method=psql_insert_copy)
purchases.to_sql('Purchases', connecton_ps, index=False, if_exists='replace')#, method=psql_insert_copy)

## Тестовые запросы к БД

In [8]:
sql = '''SELECT * FROM "public"."Users" LIMIT 5'''
select(sql)

   userId  age
0     210   33
1     929   43
2     200   52
3      45   35
4     358   28

In [9]:
sql = '''SELECT * FROM "public"."Items" LIMIT 5'''
select(sql)

   itemId   price
0      95  161.38
1      12   35.34
2     195  146.50
3      89  119.21
4     136  105.24

In [10]:
sql = '''SELECT * FROM "public"."Purchases" LIMIT 5'''
select(sql)

   purchaseId  itemId  userId                date  amount
0        4850     184     950 2008-04-06 11:54:47  161.38
1        2356      24     418 2007-07-28 00:00:19   35.34
2        2922     164     131 2008-03-14 20:43:54  146.50
3        4929     198     353 2007-12-18 13:03:24  119.21
4         510       5     849 2007-11-09 05:18:30  105.24